In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [4]:
dframe = DataFrame({'key':['A','B','C','B','C'], 'data_set_1': np.arange(5)})

In [5]:
dframe

   data_set_1 key
0           0   A
1           1   B
2           2   C
3           3   B
4           4   C

In [7]:
dframe2 = DataFrame({'key':['D','C','B','B'], 'data_set_2': np.arange(4)})

In [8]:
dframe

   data_set_2 key
0           0   D
1           1   C
2           2   B
3           3   B

In [9]:
dframe = DataFrame({'key':['A','B','C','B','C'], 'data_set_1': np.arange(5)})

In [11]:
pd.merge(dframe,dframe2)

   data_set_1 key  data_set_2
0           1   B           2
1           1   B           3
2           3   B           2
3           3   B           3
4           2   C           1
5           4   C           1

In [13]:
pd.merge(dframe, dframe2,on = 'key' )

   data_set_1 key  data_set_2
0           1   B           2
1           1   B           3
2           3   B           2
3           3   B           3
4           2   C           1
5           4   C           1

In [14]:
pd.merge(dframe,dframe2,on='key',how = 'left')

   data_set_1 key  data_set_2
0           0   A         NaN
1           1   B         2.0
2           1   B         3.0
3           2   C         1.0
4           3   B         2.0
5           3   B         3.0
6           4   C         1.0

In [15]:
pd.merge(dframe,dframe2,on='key',how='outer')

   data_set_1 key  data_set_2
0         0.0   A         NaN
1         1.0   B         2.0
2         1.0   B         3.0
3         3.0   B         2.0
4         3.0   B         3.0
5         2.0   C         1.0
6         4.0   C         1.0
7         NaN   D         0.0

In [16]:
dataframe3 = DataFrame({'key':['X','X','X','Y','Z','Z'],'data_set_3':range(6)})

In [17]:
dframe4 = DataFrame({'key':['Y','Y','X','X','Z'],'data_set_4':range(5)})

In [20]:
pd.merge(dataframe3, dframe4)

   data_set_3 key  data_set_4
0           0   X           2
1           0   X           3
2           1   X           2
3           1   X           3
4           2   X           2
5           2   X           3
6           3   Y           0
7           3   Y           1
8           4   Z           4
9           5   Z           4

In [21]:
dataframe3

   data_set_3 key
0           0   X
1           1   X
2           2   X
3           3   Y
4           4   Z
5           5   Z

In [22]:
dframe4

   data_set_4 key
0           0   Y
1           1   Y
2           2   X
3           3   X
4           4   Z